# Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [4]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data = pd.Series(['aardvark', np.nan, None, 'avocado'])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [8]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [9]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [14]:
data =pd.Series([1, np.nan, 2.5, np.nan, 7])
data

0    1.0
1    NaN
2    2.5
3    NaN
4    7.0
dtype: float64

In [15]:
data.dropna()

0    1.0
2    2.5
4    7.0
dtype: float64

In [17]:
data[data.notna()]

0    1.0
2    2.5
4    7.0
dtype: float64

In [18]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = np.nan

In [24]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  1.394009 -0.537623  0.813347
1  1.340660 -0.801224 -1.946121
2 -0.525830  1.520622 -0.203632
3 -1.587176  1.877847  0.507747
4 -0.113658 -1.230170  1.024161
5 -1.621816 -0.720366 -1.089257
6 -1.638526 -1.773529 -0.509814

In [29]:
df.iloc[:4, 1] = np.nan

In [30]:
df

          0         1         2
0  1.394009       NaN  0.813347
1  1.340660       NaN -1.946121
2 -0.525830       NaN -0.203632
3 -1.587176       NaN  0.507747
4 -0.113658 -1.230170  1.024161
5 -1.621816 -0.720366 -1.089257
6 -1.638526 -1.773529 -0.509814

In [31]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.394009       NaN       NaN
1  1.340660       NaN       NaN
2 -0.525830       NaN -0.203632
3 -1.587176       NaN  0.507747
4 -0.113658 -1.230170  1.024161
5 -1.621816 -0.720366 -1.089257
6 -1.638526 -1.773529 -0.509814

In [32]:
df.dropna()

          0         1         2
4 -0.113658 -1.230170  1.024161
5 -1.621816 -0.720366 -1.089257
6 -1.638526 -1.773529 -0.509814

In [33]:
df.dropna(thresh=2)

          0         1         2
2 -0.525830       NaN -0.203632
3 -1.587176       NaN  0.507747
4 -0.113658 -1.230170  1.024161
5 -1.621816 -0.720366 -1.089257
6 -1.638526 -1.773529 -0.509814

### Filling in Missing Data

In [34]:
df.fillna(0)

          0         1         2
0  1.394009  0.000000  0.000000
1  1.340660  0.000000  0.000000
2 -0.525830  0.000000 -0.203632
3 -1.587176  0.000000  0.507747
4 -0.113658 -1.230170  1.024161
5 -1.621816 -0.720366 -1.089257
6 -1.638526 -1.773529 -0.509814

In [35]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  1.394009  0.500000  0.000000
1  1.340660  0.500000  0.000000
2 -0.525830  0.500000 -0.203632
3 -1.587176  0.500000  0.507747
4 -0.113658 -1.230170  1.024161
5 -1.621816 -0.720366 -1.089257
6 -1.638526 -1.773529 -0.509814

In [36]:
df = pd.DataFrame(np.random.standard_normal((6,3)))

In [37]:
df

          0         1         2
0 -0.800148 -2.101460 -1.824890
1  0.849709  0.606135 -0.846127
2 -1.479175 -0.337094  0.757812
3 -2.958154 -0.089697  0.829038
4  0.180331 -0.593622 -0.163881
5  1.582429  0.443681  0.854838

In [38]:
df.iloc[2:, 1] = np.nan

In [39]:
df

          0         1         2
0 -0.800148 -2.101460 -1.824890
1  0.849709  0.606135 -0.846127
2 -1.479175       NaN  0.757812
3 -2.958154       NaN  0.829038
4  0.180331       NaN -0.163881
5  1.582429       NaN  0.854838

In [40]:
df.iloc[4:, 2] = np.nan

In [41]:
df

          0         1         2
0 -0.800148 -2.101460 -1.824890
1  0.849709  0.606135 -0.846127
2 -1.479175       NaN  0.757812
3 -2.958154       NaN  0.829038
4  0.180331       NaN       NaN
5  1.582429       NaN       NaN

In [42]:
df.fillna(method="ffill")

/tmp/ipykernel_4542/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -0.800148 -2.101460 -1.824890
1  0.849709  0.606135 -0.846127
2 -1.479175  0.606135  0.757812
3 -2.958154  0.606135  0.829038
4  0.180331  0.606135  0.829038
5  1.582429  0.606135  0.829038

In [43]:
df.fillna(method='ffill', limit=2)

/tmp/ipykernel_4542/2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.800148 -2.101460 -1.824890
1  0.849709  0.606135 -0.846127
2 -1.479175  0.606135  0.757812
3 -2.958154  0.606135  0.829038
4  0.180331       NaN  0.829038
5  1.582429       NaN  0.829038

In [44]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [45]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [46]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

In [2]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2":[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [3]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [5]:
data["v1"] = range(7)

In [6]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [7]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [8]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming data using a function or mapping

In [9]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                    "pastrami", "corned beef", "bacon",
                    "pastrami", "honey ham", "nova lox"],
                    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [10]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [12]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [13]:
def get_animal(x):
    return meat_to_animal[x]

In [14]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [15]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [18]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [19]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [20]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [21]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), index=["Ohio", "Colorado", "New York"], columns=["one", "two", "three", "four"])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [22]:
def transforms(x):
    return x[:4].upper()

In [23]:
data.index.map(transforms)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [24]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [25]:
data.index = data.index.map(transforms)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [26]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [27]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### Discretization & Binning

In [28]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [29]:
bins = [18, 25, 35, 60, 100]

In [30]:
age_cat = pd.cut(ages, bins)

In [31]:
age_cat

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [32]:
age_cat.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [33]:
age_cat.categories[0]

Interval(18, 25, closed='right')

In [34]:
pd.value_counts(age_cat)

/tmp/ipykernel_2421/1966338526.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_cat)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

### Detecting & Filtering Outliers

In [35]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007110     0.043593    -0.020692    -0.049162
std       1.025494     0.980626     0.982733     1.015483
min      -3.049150    -3.441651    -3.246686    -3.434646
25%      -0.721464    -0.574398    -0.663779    -0.711301
50%      -0.039604     0.044792     0.003764    -0.029539
75%       0.668298     0.677670     0.680014     0.624668
max       2.983245     3.097471     3.355303     3.413444

In [36]:
col = data[2]

In [37]:
col

0     -0.021753
1      0.106820
2     -0.417110
3     -0.629970
4     -0.911965
         ...
995   -1.110775
996   -0.701790
997   -1.378898
998   -1.330638
999    0.855312
Name: 2, Length: 1000, dtype: float64

In [38]:
data

            0         1         2         3
0   -1.821717  0.715295 -0.021753 -1.151362
1   -1.929420  2.112851  0.106820 -2.425009
2   -0.865993 -2.772054 -0.417110 -0.768092
3    0.105090 -0.678513 -0.629970  0.397032
4   -0.544016  0.112908 -0.911965  0.192362
..        ...       ...       ...       ...
995 -0.285131  0.538171 -1.110775 -1.903210
996  0.806295 -0.247512 -0.701790 -0.222857
997 -0.038180 -1.536308 -1.378898 -0.261286
998 -0.045864  0.766391 -1.330638 -0.264585
999 -1.646519  0.048882  0.855312  0.677379

[1000 rows x 4 columns]

In [39]:
col[col.abs() > 3]

307   -3.246686
746    3.139553
976    3.355303
Name: 2, dtype: float64

In [40]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
307  1.582774 -0.559293 -3.246686 -1.499886
482  0.046497  0.665926 -0.131999 -3.434646
746 -0.750414  1.094308  3.139553  0.162354
799 -3.049150  1.169121 -1.118243  0.356771
813 -0.468051  1.048090 -0.284721  3.413444
854  0.129565  3.097471 -2.039221  0.690455
877  0.640767  0.281713 -0.414276 -3.209737
931  1.637930 -3.441651 -0.489463  1.700117
976  1.322581 -0.474054  3.355303  0.942089

In [41]:
data[data.abs() > 3] == np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007110     0.043593    -0.020692    -0.049162
std       1.025494     0.980626     0.982733     1.015483
min      -3.049150    -3.441651    -3.246686    -3.434646
25%      -0.721464    -0.574398    -0.663779    -0.711301
50%      -0.039604     0.044792     0.003764    -0.029539
75%       0.668298     0.677670     0.680014     0.624668
max       2.983245     3.097471     3.355303     3.413444

In [42]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0  1.0  1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0 -1.0 -1.0  1.0
4 -1.0  1.0 -1.0  1.0

### Permutation & Random Sampling

In [43]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [44]:
sampler = np.random.permutation(5)

In [46]:
sampler

array([4, 0, 3, 1, 2])

In [47]:
df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [48]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

### Computing Indicator / Dummy Variables

In [49]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [50]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [51]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [52]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [ ]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table()